# Функция list и квадратные скобки [ ]
# Создание списков
# - Квадратные скобки [ ]
# Доступ к элементу по индексу
# - Метод append()
# Добавление одного элемента в конец
# - Метод extend()
# Добавление нескольких элементов в конец
# - Метод pop()
# Удаление элемента по индексу
# - Метод count()
# Подсчёт вхождения элемента
# - Метод index()
# Индекс первого вхождения элемента
# - Метод insert()
# Вставка элемента по индексу
# - Метод remove()
# Удаление элемента по значению

list_1 = list() # создание пустого списка без элементов
list_2 = list((3.14, 'Hello world', True)) # картеж сам распакуется
list_3 = []
list_4 = [3.14, 'Hello world', True]

print(list_4[0]) # 3.14
print(list_4[-1]) # True

