# множества хранят только уникальные элементы!

# - my_set = {1, 2, 3, 4, 2, 5, 6, 7} # 2 встречается 2 раза поэтому вывод будет 1, 2, 3, 4, 5, 6, 7
# Изменяемое множество

# - my_f_set = frozenset((1, 2, 3, 4, 2, 5, 6, 7,))
# Неизменяемое множество

# not_set = {1, 2, 3, 4, 2, 5, 6, 7, ['a', 'b']} # TypeError: unhashable type: 'list'

# -Метод add() - Добавляет элемент
# -Метод remove() - Удаляет элемент
# -Метод discard() - Удаляет элемент
# -Метод intersection() - Пересечение множеств, &
# -Метод union() - Объединение множеств, |
# -Метод difference() - Разность множеств,



