# Task 02

# Дан список чисел. Создайте список, в который попадают числа,
# описывающие возрастающую последовательность. Порядок элементов менять нельзя.
# Например:
# [1, 5, 2, 3, 4, 6, 1, 7] => [1, 5, 6, 7] и т.д.


li = [1, 2, 3, 4, 5, 6, 8, 9]
my_li = [li[0]]

for i in range(1, len(li)):
    if my_li[-1] < li[i]:
        my_li.append(li[i])
print(my_li)

# Var 2
# li = [1, 2, 3, 4, 5, 6, 8, 9]
# my_li = [li[0]]
# [my_li.append(li[i]) for i in range(1, len(li)) if my_li[-1] < li[i]]
# print(my_li)